# Assignment 2

### Exercise 1: Basic Dictionary Creation and Access
Objective: Create a dictionary named student_info containing at least three key-value pairs where keys are student names (as strings) and values are their respective ages (as integers). Then, access and print the age of a specific student.

In [2]:
student_info= {'Joe': 23, 'Aaron': 22, 'Vacho': 24 }
type(student_info)

dict

In [3]:
print(student_info['Vacho'])

24

### Exercise 2: Modifying Dictionary Values
**Objective:** Start with a dictionary `product_prices` where keys are product names (strings) and values are their prices (floats). Select a product and update its price. Then, add a new product with its price to the dictionary

In [4]:
product_prices={'ron': 20.90, 'pisco': 34.90, 'vodka': 28.90}
type(product_prices)

dict

In [5]:
product_prices['ron']= 25.90

In [6]:
print(product_prices)

{'ron': 25.9, 'pisco': 34.9, 'vodka': 28.9}

In [7]:
product_prices.update({'vino': 19.80})

In [8]:
print(product_prices)

{'ron': 25.9, 'pisco': 34.9, 'vodka': 28.9, 'vino': 19.8}

### Exercise 3: Dictionary Comprehension
**Objective:** Create a dictionary `squared_numbers` using dictionary comprehension where keys are integers from 1 to 10, and values are the squares of these keys.

In [9]:
squared_numbers={x: x**2 for x in range(1,11)}

In [10]:
print(squared_numbers)

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100}

### Exercise 4: Nested Dictionaries
**Objective:** Create a nested dictionary `employee_data` where each key is an employee ID (integer) and each value is another dictionary with keys 'Name', 'Position', and 'Salary'. Then, access and print the name and position of a specific employee by their ID. This dictionary `employee_data` should have only 5 keys.

In [35]:
employee_data = {101 : {'Name': 'Carellia', 'Position': 'Audiovisual Communicator', 'Salary': 1025},
102 : {'Name': 'Vacho', 'Position': 'Performance Analyst', 'Salary': 1200},
103 : {'Name': 'Aaron', 'Position': 'Freelancer', 'Salary': 1300},
104 : {'Name': 'Joe', 'Position': 'Content Creator', 'Salary': 1500},
105 : {'Name': 'Allison', 'Position': 'Media Analyst', 'Salary': 1200}}
type(employee_data)

dict

In [36]:
print(employee_data[101]['Name'])

Carellia

In [37]:
print(employee_data[101]['Position'])

Audiovisual Communicator

In [40]:
print(f"Name: {employee_data[101]['Name']}, Position: {employee_data[101]['Position']}")

Name: Carellia, Position: Audiovisual Communicator

In [ ]:
##Que es F jaja

### Exercise 5: Merging Dictionaries
**Objective:** You have two dictionaries `dict1` and `dict2` with non-overlapping keys. Merge these two dictionaries into a new dictionary `merged_dict` and print its contents. This `merged_dict` dict should have all the keys.

In [38]:
dict1 = {"A": 1, "B": 2, "C": 3}
dict2 = {"D": 4, "E": 5, "F": 6}

In [39]:
merged_dict = dict1 | dict2

In [22]:
print(merged_dict)

{'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 5, 'F': 6}

## Pandas

### Exercise 1: Selecting Single Column with .loc
**Objective**: Use .loc to select and print only the 'Name' column for all rows.

In [21]:
# Creating a DataFrame for the exercise
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']
}

In [22]:
import pandas as pd

In [23]:
type(data)

dict

In [24]:
Participants =  pd.DataFrame ( data = data )

In [25]:
Participants

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

In [26]:
Participants.loc[0:4,["Name"]]

      Name
0    Alice
1      Bob
2  Charlie
3    David
4      Eva

### Exercise 2: Row Slicing with .iloc
**Objective**: Use .iloc to select and print rows 2 through 4 (inclusive).

In [27]:
Participants.iloc[2:5]

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston
4      Eva   45    Miami

### Exercise 3: Selecting Multiple Columns with .iloc
**Objective**: Use .iloc to select and print the 'Name' and 'Age' columns for all rows.

In [28]:
Participants.iloc[0:5,0:2]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eva   45

### Exercise 4: Conditional Selection with .loc
**Objective**: Use .loc to select and print rows where the 'Age' is greater than 30.

In [29]:
import pandas as pd

In [ ]:
Participants.loc[0:5,0:2]

In [30]:
Participants.loc[Participants["Age"] > 30]

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston
4      Eva   45    Miami

### Exercise 5: Modifying Data with .loc
**Objective**: Use .loc to change the 'City' of the person named 'Alice' to 'Boston'. Then, print the updated DataFrame.

In [23]:
# Creating a DataFrame for the exercise
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']
}

In [33]:
Participants.loc[Participants["Name"] == "Alice", "City" ] = "Boston"

In [34]:
Participants

      Name  Age         City
0    Alice   25       Boston
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

In [ ]:
## Anzony no estamos seguros si esta es la forma correcta o más sencilla...